:- encoding(utf8).

nouns(L):- L=[
'Лена':pad('именит'):['Лена'],
'Лена':pad('винит'):['Лену'],
'Лена':pad('творит'):['Леной'],

'Саша':pad('именит'):['Саша'],
'Саша':pad('винит'):['Сашу'],
'Саша':pad('творит'):['Сашей'],

'Петя':pad('именит'):['Петя'],
'Петя':pad('винит'):['Петю'],
'Петя':pad('творит'):['Петей'],

'шоколад':pad('именит'):['шоколад'],
'шоколад':pad('винит'):['шоколад'],
'шоколад':pad('творит'):['шоколадом']

].

verbs(L) :- L = [
'любить':zalog('актив'):['люблю', 'любишь', 'любит', 'любим', 'любите', 'любят'],
'любить':zalog('пассив'):['любим', 'любима', 'любимо', 'любимы']
].

unions(L) :- L = [
    'и', 'да'
    ].

